#!/bin/env python
# -*- coding:utf-8 -*-

'''
这一小节说说关于参数的问题

理解几个小点：
1.不变参数以值的方式传递；
2.可变参数以指针（引用）的方式传递；

参数匹配模型
1.位置参数，从左到右进行匹配；
2.关键字参数，通过参数名来匹配，不关乎顺序；
3.默认参数，为没传入值的参数指定一个值；
4.可变参数，收集任意多个基于位置或关键字的参数，以*开头表示；
5.可变参数解包，传递任意多个基于位置或关键字的参数，与可变参数是一对的，只是可变
  参数是在函数定义头，而解包是在调用的时候；
6.keyword-only参数，参数必须按照名称传递   
'''

#1位置参数
def foo(a, b, c):
	print(a, b, c)

foo(1,2,3)

#2关键字参数,调用上
foo(b=2, a=1, c=3)

#3默认参数,注意，从第一个默认参数开始，往右都要带默认值 
def foo1(a, b, c=3):
	print(a, b, c)

foo1(1,2)

#4可变参数
def foo2(*args0, **args1):
	print("args0:")
	print(args0)

	print("args1:")
	print(args1)

a = {"a":1,"b":2}
l = [3,4,5,6]
print(a)
foo2(1, 2, *l,c=3, d=4, **a)

